Merge branch 'release/v1.2.0'
